{
  "arrive": {
    "content": "You arrive at Baba Yaga's house. ",
    "options": [
      "Hide",
      "Knock on the Door and Introduce Yourself"
    ]
  },
  "hide": {
    "content": "Baba Yaga enters her hut and spots you.",
    "options": [
      "Whimper in Silence",
      "Introduce Yourself"
    ]
  },
  "whimper": {
    "content": "You whimper like a puppydog."
  },
  "introduce": {
    "content": "You introduce yourself to Baba Yaga. You tell her your situation and she agrees to give you the light if you complete her tasks.",
    "options": [
      "Accept",
      "Refuse"
    ]
  },
  "refusetasks": {
    "content": "Your stepmother or Baba Yaga won't take nicely to this. You feel the rage inside of Baba Yaga building up."
  },
  "accept-tasks": {
    "content": "Seeing you eye Baba Yaga's lunch on the stove, she instructs you to serve her a plate. In which hand do you carry the witch's lunch?",
    "options": [
      "Left Hand",
      "Right Hand"
    ]
  },
  "supperdrop": {
    "content": "You drop the bowl and it's contents spills on the floor."
  },
  "righthand": {
    "content": "You give her, her lunch.<br>Baba Yaga instructs you to tidy her large collection of pots, sweep her yard and clean the hut."
  },
  "failtask": {
    "content": "You have chosen the wrong choice and failed the task. Baba Yaga is hungry and is not impressed by your failure."
  },
  "tidyyard": {
    "content": "You walk outside the hut to evaluate the state of messiness. It's not too messy. How do you clean it?",
    "options": [
      "Mop",
      "Rake"
    ]
  },
  "cleanhut": {
    "content": "Once you finish raking the yard to perfection, you must now clean and tidy Baba Yaga's hut.",
    "options": [
      "Procrastinate",
      "Do It Right Away"
    ]
  },
  "tidypots": {
    "content": "Satisfied that the hut is tidy, you move onto the pots.",
    "options": [
      "Clean the pots with a mop",
      "Clean the pots with a rag"
    ]
  },
  "sortseeds": {
    "content": "Baba Yaga's large collection of pots have been cleaned successfully. You have tasked to sort a large amount of pumpkin seeds into two piles: Black and Yellow. There must be over a million of those here. It would be clearly impossible to complete that task within a week. Once you do that you can make Baba Yaga's dinner.",
    "options": [
      "Dab on Baga Yaga",
      "Ask Your Doll For Help"
    ]
  },
  "doneseeds": {
    "content": "You stare with desperation at the seeds than look out the window. When you turn back you gasp in surprise to see the seeds neatly sorted into two piles. You can feel your doll's helping hand. "
  },
  "makepeasoup": {
    "content": "Next you must now cook the witch her lunch. Again, you are not sure how you are going to accomplish this seeing you have little experience cooking in the first place.",
    "options": [
      "Run Away",
      "Ask Doll For Help"
    ]
  },
  "sortedpeas": {
    "content": "Happy to see her lunch, but angry that you have passed all of her tests, Baba Yaga tells you to fill a large bucket of water with a colainder. How would you do this?",
    "options": [
      "Ask Doll For Help",
      "Flee"
    ]
  },
  "bucketfilled": {
    "content": "Baba Yaga is impressed that you managed to fill the bucket. She instructs you to count all the stars in the night sky.<br>At night, you begin to start counting the stars. 1, 2, 3, 4679. You quickly lose count. Just as you are about to give up, you hear a whisper in your ear. Your doll has told you the answer."
  },
  "foundstars": {
    "content": "Baba Yaga wakes. She fumed as you told her the answer. \"Who Told You?!\" she roars. Refusing to tell her, you remind her of the agreement. She smiles, and sets you on your way back home, light in hand."
  }
}
