{
  "arrive": {
    "content": "You arrive at Baba Yaga's house. ",
    "options": [
      "Hide",
      "Knock on the Door and Introduce Yourself"
    ]
  },
  "hide": {
    "content": "Baba Yaga enters her hut and spots you.",
    "options": [
      "Whimper in Silence",
      "Introduce Yourself"
    ]
  },
  "whimper": {
    "content": "You whimper like a puppydog."
  },
  "introduce": {
    "content": "You introduce yourself to Baba Yaga. You tell her your situation and she agrees to give you the light if you complete her tasks.",
    "options": [
      "Accept",
      "Refuse"
    ]
  },
  "refusetasks": {
    "content": "Your stepmother or Baba Yaga won't take nicely to this."
  },
  "accept-tasks": {
    "content": "Baba Yaga asks her to carry to her, her lunch.",
    "options": [
      "Left Hand",
      "Right Hand"
    ]
  },
  "supperdrop": {
    "content": "You drop the bowl and it's contents spills on the floor."
  },
  "righthand": {
    "content": "You give her her lunch.<br>You are instructed to tidy the pots, sweep the yard and clean the hut."
  },
  "failtask": {
    "content": "You have chosen the wrong choice and failed the task. Baba Yaga is hungry and is not impressed by your failure."
  },
  "tidyyard": {
    "content": "It's time to clean the yard. How do you do it?",
    "options": [
      "Mop the Yard",
      "Rake the Yard"
    ]
  },
  "cleanhut": {
    "content": "You are instructed to clean Baba Yaga's house.",
    "options": [
      "Procrastinate",
      "Do It Right Away"
    ]
  },
  "tidypots": {
    "content": "Baba Yaga has instructed you to tidy and clean her pots.",
    "options": [
      "Clean the pots with a mop.",
      "Use a rag."
    ]
  },
  "sortseeds": {
    "content": "You have to sort out the seeds into two piles. Black and Yellow. There must be over  a million of those here.",
    "options": [
      "Dab on Baga Yaga",
      "Ask Doll For Help"
    ]
  },
  "doneseeds": {
    "content": "baba yaga impressed. wow! you gotta make pea soup and fill up this bucket of water using this sift."
  },
  "makepeasoup": {
    "content": "you gotta make pea soup and sort out all of these peas. OOF!",
    "options": [
      "Run Away",
      "Ask Doll For Help"
    ]
  },
  "sortedpeas": {
    "content": "You've sorted out the peas with the help of the doll but now you have to fill the bucket of water with the sieve.",
    "options": [
      "Ask Doll For Help",
      "Flee"
    ]
  },
  "bucketfilled": {
    "content": "Baba Yaga is impressed. She instructs you to count all the stars in the night sky.<br>How will you do this?"
  },
  "foundstars": {
    "content": "Baba Yaga wakes to find you. You tell her the number of stars in the night sky. She is outrages. <br>\"Who told you?\" she demands. <br> You remind her that she owes you a light. You comply."
  }
}
